#난기초가탄탄한게좋아
#그럼 일단 파이썬파일 만들어봐 
#베이직.파이 
#이렇게 

#너는 오늘 자료형~ 에 대해서 배울 거야 오키? 야스
#우선 너가 아는 자료형 말해봐 자료형이뭔데?
# 잘봐 

#영문 변환 ㄱㄱㄱ
i = 0 # ㅇ여기서 이 아이 라는 변수는 정수잖아? 그치 ?그치
#이게 자료형 이야 
# 이런 변수의 타입 
# 
str = '문자열'
print(i)
print(str)
#오키? 웅   자료형이란 뭐라고? 변수의 타입 맞아 맞아 
#전에 너가 키보드 에서 데이터 입력받을 때 막 오류 뜨고 에러뜨고 그랬지? 
#엉 그게 키보드 타입자체는 문자열로주는데 
#너가 그걸 정수처럼 사용해서~~ 그렇다~ 오키? 오키
# 자 그렇다면 
dudwns = 1.3123123
print(dudwns)

#여기서 영준은은 실수형 타입이다~ 오케? 오홍 
# 원래 더 훨씬더 많은 자료형이있어 근데 보통 많이 사용하는 형을 설명해주는 거야 오키? 야스
#자그럼 여기서 타입이 뭔지 몰라!! 그럼 어떤식으로 많이 알아내냐면 
print(type(dudwns))
#이런식으로 많이 알아내 저기 플롯이라고 적혀서 나왔지 ?ㅇㅇ
# 저기 봐바 플롯있지? 오오 
#그 밑에 더블은 더 큰 소수를 표현할 때 더블이라고 해 오케? 오케
#그럼 우리가 보통 많이사용하던 인트 있지 ?웅저건 정수 
# 쇼트 저거있지? 저것도 정수인데 !! 좀더 작은 자료형이야 
#왜이런식으로 자료형을 나누는지는 알아? 
#ㅁㄹ
# 왜냐면 컴퓨터 용량은 한정적이잖아? 웅
#그럼 그옆에 지금 바이트 목록있지? 
#2ㅇ ㅇ4 4 2 44 11 48 이라고 적혀있는거 ㅇㅇㅇ
#저게 이제 우리가 텍스트파일 만들면 나오는 그바이트야 #
#오키? 오키 
#그런데 우리는 글자를 1글자만쓸껀데 쓸때없이 더블로 잡아서 8바이트 를 소모할 필요가있어없어?업싲
#그렇기때문에 본인이 사용할 자료형을 잘 골라서 써야돼 
# 메모리 최적화? 이런 내용야이야 오케?오케!
# 그럼 왜 본인이 자료형을 왜 선택해서 써야되는지 이해는 했지? 
# 웅웅ㅋㅋㅋ
# 좋아 지금 옆에 저기 보면 차~~ 라고 적혀있는 
#자료형 잇지?  char? dnd엉엉
#  저게 한 문자!!! 
# 그리고 스트링이라는 자료형이 추가로있어 
# 찾기 힘드니까 스트링은 문자열!!! 
# 문자 와 문자열은 확실히 다른 거야 오키 ?노키 
# 음... a << 이거 문자야? 문자열이야? 문자?
# abc << 이거 문자야? 문자열이야? 문자열?
# 근데왜 노키래 아는데 느낌ㅋ ㅋ
# 한 개는 문자 
#한개이상은 문자열 오키? 오키
# 그리고 문자열은 표시자체를 다른 언어에서는 이런식으로해 
# 예!!  'ㅎ'
# 오키? 오키1
# 그런데 "ㅎ" 이렇게하면 문자열이 되는 언어도있어 
#오키? 오키
#뭔가다른지는 알지 ?
#하나고 두갠데.. 웅 그거야 그차이임 
#아아! 1
# 오키 그럼 
#이제 문자열까지 배웠으니까 오케 
#그리고 컴퓨터는 1과 0 으로만 이루어져있는건 알지? 
#옹옹이지
# 그래서 트루 ~ 아니면 펄스야 컴퓨터의 결과는 오키? 
#오키 
#그걸 또 자료형으로 나타내는 자료형이 있어 
#그건 부울 이라는 자료형이라고함
# 부울buwul?bowul?bowl?fi~re# dhzl ?
#오큐ㅣ 오키오키 저거는 
# 자료형이트루 ! 또는 펄스 이것밖에 가지지 못함 
#오키? 웅웅ㅇ 
# 자그럼 자료형 끝!! 
# 쉽지 ?웅
#그런데 파이썬은 자료형을 알아서 다 잡아줌
#오키? 
#오좋은거네
#웅 그렇기때문에 느림
#오키? 
#아하
 #파ㅣ썬ㅇ ㅡㄴ 언어중에 가장 느리다고 소문난 언어이다.
 #오키? 오호오키근데느린거왜씀?
 # 기술의 발전에 의해서 느린 언어임에도 불구하고 
 #컴퓨터 속도가 ㅈㄴ 올라가서 티가안나
 #오 구린척하지만 좋은거네
 #안좋은 컴터에선 느린 게 티가 난다는소리지 
 #옹ㅇㅋ!!? ㅇㅇㅇ 
 # 자아 그럼  저 차이임 
 #아아인 간은 못느껴
 # 그런데 0.01 초가 모이다보면 1초가되고 
 #10초가되고 그러거든? 
 #그래서 코드가 커지면 커질 수 록 느려져 
 #아아~~그렇겟네
 #그렇지~~
 #자 그럼 이제 자료형 설명 끝났어~ 
#이제 배열 에대해서 설명할꺼야 
#ㅇㅋ? 
#그럼 배열하기전에 잠깐 쉴까/
#아니? 
#ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ이렇게 하니까 진짜 수업듣는거같다
##마아 맞아 좀 맞아야 ㅋ진짴 수엌ㅋㅋㅂㅋㅋㅋㅋ인데 ㅋㅋㅋㅋㅋㅋ
#이렇게하니까 나 지금 한 세번 졸앗엌ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ놀
#그래도 못쉼 
#어키어키 배열 고고
#ㅊ 기초 힘들지? 
#웅
#원래 그래서 기초는 안알려주고 그냥 바로 코딩한거였어!
#아냐그래도알려조기초
#잇고싶어
#그래 그다음엔 
#배열 하자 웅웅

#음... 
# 너가 일단 선언해봐 이제부턴 코딩하면서 해보자 
#음 ... 이건 파이썬에서 하지말고 씨언어에서 해야돼 
#원래 기초는 씨언어에서 닦아야 진짜 잘닦았다고 하는거야 
#이해했어 ?야스
#
#자일단 
#너가 알아야할 것 
# 배열 / 자료형 / 함수 / 변수 
# 반복문 / 조건문 
#이게 코딩의 전부야 
#오키? 옴키
# 저기서 함수는 뭐고 자료형은 뭔지 알것같아? 
#int 가 자료형 마자 printf 가 함수 맞아 int빼고 다 함수? 
#아니지 봐봐 
#씨언어에서 함수는 
# 공식이라고생각해봐 
# 반환값 함수이름(인자값)
# {
#   함수 내용 
# }
#오키? 오키 
# 저기서 반환값이 인트라는거는 정수를 반환 해준다는소리야 오키? 오키!!너 자지?
#ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ아냐졸앗어 자
#진않음
#뒤져 자면 ㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋㅋ아웃기다진짜 나 수업듣다 조는거 진짜 간만
# ㅎㅎㅎ 뒤질라고 ㅎㅎ ㅎ
#자그럼 저거랑 똑같은 거 함수 만들어봐 저기 위에다가 
#어디위에 오른쫒ㄱ ㅓ 글 자 위에 

i =  { 0,1,2,3,4,5,6,6,7,8,9}